package ru.yandex.zhilin.level1;

class Main {

    public static void main(String[] args) {
        /*
            Создайте коробку Box.
            Сделайте так, чтобы она могла принимать объекты типа Spice.
            Добавьте коробке возможность вывести в консоль, какие специи
            она содержит.

            Проверьте, что коробка предназначена только для специй и не может
            содержать, например, Integer или любой другой класс.

            Проверьте, что в коробку с паприкой нельзя пололжить корицу.
         */
    }
}
